IDENTIFICATION DIVISION.
PROGRAM-ID. FILECMPR.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT POLICY-IN1 ASSIGN TO POL1
    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE IS SEQUENTIAL
    FILE STATUS IS WS-FIL-ST1.

    SELECT POLICY-IN2 ASSIGN TO POL2
    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE IS SEQUENTIAL
    FILE STATUS IS WS-FIL-ST2.

    SELECT POLICY-OUT1 ASSIGN TO POL3
    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE IS SEQUENTIAL
    FILE STATUS IS WS-FIL-ST3.

    SELECT POLICY-OUT2 ASSIGN TO POL4
    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE IS SEQUENTIAL
    FILE STATUS IS WS-FIL-ST4.

    SELECT POLICY-OUT3 ASSIGN TO POL5
    ORGANIZATION IS SEQUENTIAL
    ACCESS MODE IS SEQUENTIAL
    FILE STATUS IS WS-FIL-ST5.

DATA DIVISION.
FILE SECTION.
FD POLICY-IN1
    RECORD CONTAINS 80 CHARACTERS
    BLOCK CONTAINS 800 CHARACTERS
    RECORDING MODE IS F.
01 POLICY-DETAILS-IN1.
   05 POLICY-NUMBERI1    PIC 9 (05).
   05 FILLER             PIC X (75).

FD POLICY-IN2
    RECORD CONTAINS 80 CHARACTERS
    BLOCK CONTAINS 800 CHARACTERS
    RECORDING MODE IS F.
01 POLICY-DETAILS-IN2.
   05 POLICY-NUMBER12    PIC 9(05).
   05 FILLER             PIC X (75).

FD POLICY-OUT1
    RECORD CONTAINS 80 CHARACTERS
    BLOCK CONTAINS 800 CHARACTERS
    RECORDING MODE IS F.
01 POLICY-DETAILS-OUT1.
   05 POLICY-NUMBER01    PIC 9 (05).
   05 FILLER             PIC X (75).

FD POLICY-OUT2
    RECORD CONTAINS 80 CHARACTERS
    BLOCK CONTAINS 800 CHARACTERS
    RECORDING MODE IS F.
01 POLICY-DETAILS-OUT2.
   05 POLICY-NUMBERO2    PIC 9 (05).
   05 FILLER             PIC X (75).

FD POLICY-OUT3
    RECORD CONTAINS 80 CHARACTERS
    BLOCK CONTAINS 800 CHARACTERS
    RECORDING MODE IS F.
01 POLICY-DETAILS-OUT3.
   05 POLICY-NUMBERO3    PIC 9(05).
   05 FILLER             PIC X (75).

WORKING-STORAGE SECTION.
01 WS-EOF1               PIC X (01).
01 WS-E0F2               PIC X (01).
01 WS-INPUT-REC1-COUNT   PIC 9 (02).
01 WS-INPUT-REC2-COUNT   PIC 9(02).
01 WS-OUTPUT-REC1-COUNT  PIC 9 (02).
01 WS-OUTPUT-REC2-COUNT  PIC 9 (02).
01 WS-OUTPUT-REC3-COUNT  PIC 9(02).
01 WS-VALID-RECORD       PIC X (01)
01 WS-AGE-IN             PIC 9(03).
01 WS-FIL-ST1            PIC 9 (02).
01 WS-FIL-ST2            PIC 9 (02).
01 WS-FIL-ST3            PIC 9(02).
01 WS-FIL-ST4            PIC 9 (02).
01 WS-FIL-ST5            PIC 9 (02).
01 WS-ABEND-PGM          PIC X (10) VALUE 'ABENDPG1'.

PROCEDURE DIVISION.
0000-MAIN-PARA.
    DISPLAY * START OF FILECMPR PROGRAM *
    PERFORM 1000-INITIALIZE        THRU 1000-EXIT.
    PERFORM 2000-READ-INPUT-FILE1  THRU 2000-EXIT.
    PERFORM 2500-READ-INPUT-FILE2  THRU 2500-EXIT.
    PERFORM 3000-PROCESS           THRU 3000-EXIT
            UNTIL WS-EOF = OR WS-EOF = 'Y'.
    PERFORM 9000-SUMMARY           THRU 9000-EXIT.

1000-INITIALIZE.
    DISPLAY 'IN INITIALIZE'
    OPEN INPUT POLICY-IN1.
    DISPLAY WS-FIL-ST1.
    IF WS-FIL-ST1 = 0
         DISPLAY 'INPUT FILE1 OPENING IS SUCCESSFUL'
    ELSE
         DISPLAY INPUT FILE1 OPENING FAILED IN 1000-PARA'
         DISPLAY 'FILE STATUS IS: ' WS-FIL-ST1
         CALL WS-ABEND-PGM
    END-IF.

    OPEN INPUT POLICY-IN2.
    DISPLAY WS-FIL-ST2.
    IF WS-FIL-ST2 = 0
         DISPLAY 'INPUT FILE2 OPENING IS SUCCESSFUL
    ELSE
         DISPLAY INPUT FILE2 OPENING FAILED IN 1000-PARA'
         DISPLAY 'FILE STATUS IS: ' WS-FIL-ST1
         CALL WS-ABEND-PGM
    END-IF.

    OPEN OUTPUT POLICY-OUT1.
    DISPLAY WS-FIL-ST3.
    IF WS-FIL-ST3 = 0
         DISPLAY 'OUTPUT FILE OPENING IS SUCCESSFUL'
    ELSE
         DISPLAY 'OUTPUT FILE OPENING FAILED IN 1000-PARA'
         DISPLAY 'FILE STATUS IS: ' WS-FIL-ST3
         CALL WS-ABEND-PGM
    END-IF.

    OPEN OUTPUT POLICY-OUT2.
    DISPLAY WS-FIL-ST4.
    IF WS-FIL-ST4 = 0
         DISPLAY 'OUTPUT FILE OPENING IS SUCCESSFUL'
    ELSE
         DISPLAY 'OUTPUT FILE OPENING FAILED IN 1000-PARA'
         DISPLAY 'FILE STATUS IS: ' WS-FIL-ST4
         CALL WS-ABEND-PGM
    END-IF.

    OPEN OUTPUT POLICY-OUT3.
    DISPLAY WS-FIL-ST5.
    IF WS-FIL-ST5 = 0
         DISPLAY OUTPUT FILE OPENING IS SUCCESSFUL'
    ELSE
         DISPLAY 'OUTPUT FILE OPENING FAILED IN 1000-PARA'
         DISPLAY 'FILE STATUS IS" WS-FIL-ST5
         CALL WS-ABEND-PGM
    END-IF.

    MOVE ZEROES TO POLICY-NUMBERI1
    MOVE ZEROES TO POLICY-NUMBER12.
    MOVE ZEROES TO POLICY-NUMBER01.
    MOVE ZEROES TO POLICY-NUMBER02.
    MOVE ZEROES TO POLICY-NUMBER03.

    MOVE 'N' TO WS-EOF1.
    MOVE 'N' TO WS-EOF2.
    MOVE ZEROES TO WS-INPUT-REC1-COUNT.
    MOVE ZEROES TO WS-INPUT-REC2-COUNT
    MOVE ZEROES TO WS-OUTPUT-REC1-COUNT.
    MOVE ZEROES TO WS-OUTPUT-REC2-COUNT.
    MOVE ZEROES TO WS-OUTPUT-REC3-COUNT.
    MOVE 'Y' TO WS-VALID-RECORD.

1000-EXIT.
    EXIT.

2000-READ-INPUT-FILE1.
    READ POLICY-IN1
        AT END
           MOVE 'יץ TO WS-EOF1
        NOT AT END
           CONTINUE
    END-READ.
    MOVE 'Y' TO WS-VALID-RECORD.
    ADD +1 TO WS-INPUT-REC1-COUNT.

2000-EXIT.
    EXIT.

2500-READ-INPUT-FILE2.
    READ POLICY-IN2
        AT END
           MOVE 'יץ TO WS-E0F2
        NOT AT END
           CONTINUE
    END-READ.
    MOVE 'Y' TO WS-VALID-RECORD.
    ADD +1 TO WS-INPUT-REC2-COUNT.

2500-EXIT.
    EXIT.

3000-PROCESS.
    EVALUATE TRUE
        WHEN POLICY-NUMBER11 = POLICY-NUMBERI2
             PERFORM 3200-WRITE-MATCH-PARA THRU 3200-EXIT.
             PERFORM 2000-READ-INPUT-FILE1 THRU 2000-EXIT.
             PERFORM 2500-READ-INPUT-FILE2 THRU 2500-EXIT.
        WHEN POLICY-NUMBERI1 > POLICY-NUMBER12
             PERFORM 3210-WRITE-ONLY-FILE2 THRU 3210-EXIT.
             PERFORM 2500-READ-INPUT-FILE2 THRU 2500-EXIT.
        WHEN POLICY-NUMBERI1 < POLICY-NUMBER12
             PERFORM 3220-WRITE-ONLY-FILE1 THRU 3220-EXIT.
             PERFORM 2000-READ-INPUT-FILE1 THRU 2000-EXIT.
    END-EVALUATE.

3000-EXIT.
EXIT.

3200-WRITE-MATCH-PARA.
    MOVE POLICY-NUMBERI 1 TO POLICY-NUMBERO1
    WRITE POLICY-DETAILS-OUT1.
    EVALUATE WS-FIL-ST3
        WHEN O
          DISPLAY OUT FILE WRITING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY 'OUT FILE WRITING FAILED IN 3200-PARA'
          DISPLAY OUT FILE STATUS IS: WS-FIL-ST3
          CALL WS-ABEND-PGM
    END-EVALUATE.
    ADD +1 TO WS-OUTPUT-REC1-COUNT.

3200-EXIT.
EXIT.

3210-WRITE-ONLY-FILE2.
    MOVE POLICY-NUMBERI 2 TO POLICY-NUMBER02
    WRITE POLICY-DETAILS-OUT2.
    EVALUATE WS-FIL-ST3
        WHEN O
          DISPLAY OUT FILE WRITING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY OUT FILE WRITING FAILED IN 3210-PARA'
          DISPLAY 'OUT FILE STATUS IS: WS-FIL-ST4
          CALL WS-ABEND-PGM
    END-EVALUATE.
    ADD +1 TO WS-OUTPUT-REC2-COUNT.

3210-EXIT.
    EXIT.

3220-WRITE-ONLY-FILE1.
    MOVE POLICY-NUMBERI 1 TO POLICY-NUMBER03
    WRITE POLICY-DETAILS-OUT3.
    EVALUATE WS-FIL-ST5
        WHEN O
          DISPLAY OUT FILE WRITING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY 'OUT FILE WRITING FAILED IN 3220-PARA'
          DISPLAY OUT FILE STATUS IS:' WS-FIL-ST5
          CALL WS-ABEND-PGM
    END-EVALUATE.
    ADD +1 TO WS-OUTPUT-REC3-COUNT.

3220-EXIT.
    EXIT.

9000-SUMMARY.
    CLOSE POLICY-IN1
    EVALUATE WS-FIL-ST1
        WHEN O
          DISPLAY 'FILE CLOSING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY 'FILE CLOSING FAILED IN 9000-PARA'
          DISPLAY 'FILE STATUS IS: WS-FIL-ST1
          CALL WS-ABEND-PGM
    END-EVALUATE.

    CLOSE POLICY-IN2
    EVALUATE WS-FIL-ST2
        WHEN O
          DISPLAY 'FILE CLOSING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY 'FILE CLOSING FAILED IN 9000-PARA'
          DISPLAY 'FILE STATUS IS: WS-FIL-ST2
          CALL WS-ABEND-PGM
    END-EVALUATE.

    CLOSE POLICY-OUT 1
    EVALUATE WS-FIL-ST3
        WHEN O
          DISPLAY 'FILE CLOSING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY 'FILE CLOSING FAILED IN 9000-PARA'
          DISPLAY 'FILE STATUS IS: WS-FIL-ST3
          CALL WS-ABEND-PGM
    END-EVALUATE.

    CLOSE POLICY-OUT2
    EVALUATE WS-FIL-ST4
        WHEN O
          DISPLAY 'FILE CLOSING IS SUCCESSFUL
        WHEN OTHER
          DISPLAY 'FILE CLOSING FAILED IN 9000-PARA'
          DISPLAY 'FILE STATUS IS:' WS-FIL-ST4
          CALL WS-ABEND-PGM
    END-EVALUATE.

    CLOSE POLICY-OUT3
    EVALUATE WS-FIL-ST5
        WHEN O
          DISPLAY 'FILE CLOSING IS SUCCESSFUL'
        WHEN OTHER
          DISPLAY 'FILE CLOSING FAILED IN 9000-PARA'
          DISPLAY 'FILE STATUS IS:' WS-FIL-ST5
          CALL WS-ABEND-PGM
    END-EVALUATE.

    DISPLAY '==> TOTAL NUMBER OF INPUT1 RECORDS : ' WS-INPUT-REC1-COUNT.
    DISPLAY '==> TOTAL NUMBER OF INPUT2 RECORDS : ' WS-INPUT-REC2-COUNT.
    DISPLAY '==> TOTAL NUMBER OF MATCH RECORDS  : ' WS-OUTPUT-REC1-COUNT.
    DISPLAY '==> TOTAL NUMBER OF ONLYF2 RECORDS : ' WS-OUTPUT-REC2-COUNT.
    DISPLAY '==> TOTAL NUMBER OF ONLYF1 RECORDS : ' WS-OUTPUT-REC3-COUNT.
    DISPLAY  '* END OF FILECMPR PROGRAM *'

9000-EXIT.
    EXIT.