      IDENTIFICATION DIVISION.
      PROGRAM-ID. HELLO.
      PROCEDURE DIVISION.
          DIsPLAY "HELLO FROM COBOL!".
      STOP RUN.
      

